app/controllers/artists_controller.rb

  def index
    @artists = Artist.all
---
SELECT * FROM "artists"

  def show
    @artist = Artist.find(params[:id])
---
SELECT * FROM "artists" WHERE ("artists"."id" = 2)